--- a/README.md
+++ b/README.md
@@ -58,10 +71,12 @@ This video provides a concise overview of deploying Loggle, configuring log forw
 
 Your applications forward their logs to the OpenTelemetry Collector, which exports them to the Log Ingestion API. The Log Ingestion API processes the data and stores it in Elasticsearch, from where Kibana pulls the data for visualization.
 
-```plaintext
-+------------------+      +-------------------------+      +-------------------+      +---------------+      +--------+
-| Application Logs | ---> | OpenTelemetry Collector | ---> | Log Ingestion API | ---> | Elasticsearch | ---> | Kibana |
-+------------------+      +-------------------------+      +-------------------+      +---------------+      +--------+
+```mermaid
+graph TB
+    A[Application Logs] --> B[OpenTelemetry Collector]
+    B --> C[Log Ingestion API]
+    C --> D[Elasticsearch]
+    D --> E[Kibana]
 ```
 
 ## Cloud Deployment Guide
